//12可以被拆分成一组勾股数 (3,4,5)的和，24也可以被拆分成一组勾股数 (6,8,10)的和，类似的36，40，48都可以。
//12 : (3,4,5)
//24 : (6,8,10)
//30 : (5,12,13)
//36 : (9,12,15)
//40 : (8,15,17)
//48 : (12,16,20)
//但是20却无论如何都不可能被拆分成一组够股数的和。
//请问3～1000之间多少个整数可以被拆分为勾股数的和？

//一个数能拆分成勾股定理的组合数，勾股定理又称毕达哥拉斯定理(毕氏定理)
function pythagorean(n) {
	var count = 0;
	for(var x = 1; x < n; x++) {
		for(var y = x; y < n; y++) {
			var z = n - x - y;
			if(z > y && x * x + y * y == z * z) {
				count++;
			}
		}
	}
	return count;
}

var num = 0;
for(var i = 3; i <= 1000; i++) {
	if(pythagorean(i) > 0) {
		num++;
	}
}
console.log(num);