//12是能围成一个整数边长的直角三角形的最小长度，能围成整数边长的直角三角形的长度还有很多：
//12 : (3,4,5)
//24 : (6,8,10)
//30 : (5,12,13)
//36 : (9,12,15)
//40 : (8,15,17)
//48 : (12,16,20)
//相反，20就不可能是一个整数边长的直角三角形的周长。而有一些长度就不止是围成一种直角三角形了，例如120的长度能围成三种不同的直角三角形。
//120 : (30,40,50), (20,48,52), (24,45,51)
//假设直角三角形的周长为L，当12≤ L ≤ 150,0000，请问只能以一种方式构成整数边的直角三角形的L有多少个？

//最大公约数-更相减损法
function gcd(i, j) {
	while(i != j) {
		if(i > j) {
			i = i - j;
		} else {
			j = j - i;
		}
	}
	return i;
}

var match = 0;
var max_L = 1500000;
var mark = [];
for(var a = 2; a <= Math.sqrt(max_L / 2); a++) {
	for(var b = a - 1; b > 0; b -= 2) {
		if(gcd(a, b) == 1) {
			var L = 2 * a * (a + b);
			for(var t = L; t <= max_L; t += L) {
				mark[t] = mark[t] == undefined ? 1 : (mark[t] + 1);
			}
		}
	}
}
for(var i = 1; i <= max_L; i++) {
	if(mark[i] == 1) {
		match++;
	}
}
console.log(match);